config/gptel/sessions/branching.org
#+title: GPTEL Session Branching
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle branching.el
#+auto_tangle: y

* Introduction

Session branching support for =gptel-chat-mode= sessions. Allows users
to create divergent conversation paths from any user turn in the
current branch's =session.org= buffer.

Branches are full-fledged session directories with:
- Copied agent subdirectories
- Truncated context (=session.org=) copied verbatim from =point-min= up
  to the selected branch-point position; the parent's =:PROPERTIES:=
  drawer at point-min rides along and carries the preset AND the
  resolved =:GPTEL_SCOPE_*:= keys into the new branch without a
  separate scope or metadata file (gptel-scope-in-org-properties:
  drawer-resident scope)

Chat-mode buffers have no text-property annotation for turn regions —
the =#+begin_user= / =#+end_user= block is the authoritative user-turn
marker, and =gptel-chat-parse-buffer= is the authoritative scanner
for branch-point selection.

* Lexical Binding

#+begin_src emacs-lisp :comments no
;;; branching.el --- GPTEL Session Branching -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Session branching support for gptel-chat-mode persistent sessions.
;; Enables creating divergent conversation paths from any user turn.

;;; Code:

(require 'cl-lib)
(require 'gptel-chat-parser)
(require 'gptel-session-constants)
(require 'gptel-session-logging)
(require 'gptel-session-filesystem)
#+end_src

* Branch Point Detection

Branch-point detection enumerates outer =#+begin_user= blocks in the
current buffer using =gptel-chat-parse-buffer=. Assistant blocks,
nested tool blocks, and non-block content (headings, prose, drawers)
are NOT valid branch points.

** Find User Turns

#+begin_src emacs-lisp
(defun jf/gptel--branching-user-turns (&optional buffer)
  "Return the user turns from BUFFER in document order.
BUFFER defaults to the current buffer.  Each returned element is the
parser turn plist as produced by `gptel-chat-parse-buffer' — a plist
with `:role', `:content', `:start', and `:end'.

Only outer `#+begin_user' blocks are returned.  Assistant blocks,
nested tool blocks, and non-block content are filtered out."
  (let ((turns (gptel-chat-parse-buffer (or buffer (current-buffer)))))
    (seq-filter (lambda (turn) (eq (plist-get turn :role) 'user))
                turns)))
#+end_src

** Turn Label

A short human-readable label for a user turn — used in the numbered
selection prompt. Shows the first non-empty line of the user block's
body, up to 60 characters, with a =...= ellipsis when truncated. Empty
or whitespace-only user blocks are labelled =(empty)= so they are still
distinguishable in the list.

#+begin_src emacs-lisp
(defun jf/gptel--branching-turn-label (turn)
  "Return a short display label for the user TURN plist.
The label is the first non-empty line of the turn's content, trimmed
and truncated to 60 characters with a trailing `...' when longer.  An
empty or whitespace-only user block yields the string \"(empty)\"."
  (let* ((content (or (plist-get turn :content) ""))
         (trimmed (string-trim content)))
    (if (string-empty-p trimmed)
        "(empty)"
      (let* ((first-line (car (split-string trimmed "\n")))
             (flat (string-trim first-line)))
        (if (> (length flat) 60)
            (concat (substring flat 0 57) "...")
          flat)))))
#+end_src

** Include / Exclude Branch-Point Position

Given a selected user turn and a caller-chosen include/exclude
decision, compute the absolute buffer position that marks the branch
point.

- Include → position immediately after the =#+end_user= line that
  closes the turn (so the new branch ends with the selected user turn
  complete, awaiting an assistant response).
- Exclude → position immediately before the =#+begin_user= line that
  opens the turn (so the new branch ends before the selected user
  turn, awaiting a fresh user prompt).

The parser stores =:start= as a marker at the column-zero start of the
=#+begin_user= line and =:end= as a marker at the column-zero start of
the =#+end_user= line. For the include case we advance one line past
the =#+end_user= line; for the exclude case we simply use =:start=.

#+begin_src emacs-lisp
(defun jf/gptel--branching-turn-branch-point (turn include-p)
  "Return the branch-point buffer position for the user TURN.
INCLUDE-P chooses the semantics:
- non-nil INCLUDE-P → position immediately after the `#+end_user' line
  (the new branch contains the selected turn);
- nil INCLUDE-P → position immediately before the `#+begin_user' line
  (the new branch stops before the selected turn).

Positions are returned as integers in the turn's source buffer."
  (let ((start-marker (plist-get turn :start))
        (end-marker   (plist-get turn :end)))
    (if include-p
        ;; Include: skip past the `#+end_user' line.
        (with-current-buffer (marker-buffer end-marker)
          (save-excursion
            (goto-char (marker-position end-marker))
            (forward-line 1)
            (point)))
      ;; Exclude: stop before the `#+begin_user' line.
      (marker-position start-marker))))
#+end_src

** Select Branch Point Interactively

Build a numbered =completing-read= list, preserving document order.
The display string includes the turn number so the user sees =1.=,
=2.=, =3.= ... prefixes. Picks up the user's include/exclude choice
via =y-or-n-p= immediately after the turn selection.

Signals a =user-error= with the message =no available branch points=
when the buffer contains no outer =#+begin_user= blocks.

#+begin_src emacs-lisp
(defun jf/gptel--branching-select-branch-point ()
  "Interactively select a branch point from the current buffer's user turns.

Returns a cons (POSITION . INCLUDE-P) where POSITION is the buffer
position of the branch point (see
`jf/gptel--branching-turn-branch-point') and INCLUDE-P is non-nil when
the user chose INCLUDE.

Signals `user-error' with the message \"no available branch points\"
when the buffer contains no outer `#+begin_user' blocks."
  (let ((turns (jf/gptel--branching-user-turns)))
    (unless turns
      (user-error "No available branch points"))
    (let* ((numbered (cl-loop for turn in turns
                              for i from 1
                              collect
                              (cons (format "%d. %s"
                                            i
                                            (jf/gptel--branching-turn-label turn))
                                    turn)))
           (choice (completing-read "Select branch point: "
                                    (mapcar #'car numbered)
                                    nil t))
           (selected-turn (cdr (assoc choice numbered)))
           (include-p (y-or-n-p "Include this turn in the branch? "))
           (position (jf/gptel--branching-turn-branch-point
                      selected-turn include-p)))
      (cons position include-p))))
#+end_src

* Context Truncation

Copy the source branch's =session.org= to the new branch's
=session.org=, truncated to =[point-min, BRANCH-POSITION)=.

Chat-mode has no text-property bounds annotation — the block structure
is the authoritative turn layout — so there is no bounds-filter or
bounds-rewrite step. The branch-point is always on a line boundary
outside any open block (by construction of
=jf/gptel--branching-turn-branch-point=), so block-delimiter integrity
is preserved verbatim.

** Copy Truncated Context

#+begin_src emacs-lisp
(defun jf/gptel--copy-truncated-context (source-file dest-file branch-position)
  "Copy SOURCE-FILE to DEST-FILE truncated at BRANCH-POSITION.

Writes bytes 1..(BRANCH-POSITION - 1) of SOURCE-FILE to DEST-FILE
verbatim.  BRANCH-POSITION is a 1-based buffer position as returned by
`jf/gptel--branching-turn-branch-point'.  A BRANCH-POSITION at or past
the end of SOURCE-FILE copies the full file.  A BRANCH-POSITION of 1
writes an empty file.

Returns t on success."
  (with-temp-buffer
    (insert-file-contents source-file)
    (let ((truncate-at (min (max branch-position (point-min)) (point-max))))
      (delete-region truncate-at (point-max))
      (write-region (point-min) (point-max) dest-file nil 'silent))
    (jf/gptel--log 'info
                   "Copied truncated context: %s -> %s (branch-position=%d)"
                   source-file dest-file branch-position)
    t))
#+end_src

* Agent Copying

Copy agent subdirectories from the parent branch to the new branch.
Unchanged across the chat-mode migration — agent directories live
under =<branch>/agents/= and are opaque to the branch-point logic.

** Copy Branch Agents

#+begin_src emacs-lisp
(defun jf/gptel--copy-branch-agents (parent-branch-dir branch-dir)
  "Copy agent subdirectories from PARENT-BRANCH-DIR/agents to BRANCH-DIR/agents.
For MVP, copies ALL agent directories.
Future enhancement: Only copy agents invoked before branch point."
  (let ((parent-agents-dir (jf/gptel--agents-dir-path parent-branch-dir))
        (branch-agents-dir (jf/gptel--agents-dir-path branch-dir)))
    (when (file-directory-p parent-agents-dir)
      ;; Create agents directory in branch
      (make-directory branch-agents-dir t)

      ;; Copy each agent directory
      (dolist (agent-dir (directory-files parent-agents-dir t "^[^.]"))
        (when (file-directory-p agent-dir)
          (let* ((agent-name (file-name-nondirectory agent-dir))
                 (dest-dir (expand-file-name agent-name branch-agents-dir)))
            (copy-directory agent-dir dest-dir t t t)
            (jf/gptel--log 'debug "Copied agent directory: %s" agent-name))))

      (jf/gptel--log 'info "Copied %d agent directories to branch"
                    (length (directory-files parent-agents-dir nil "^[^.]"))))))
#+end_src

