config/gptel/sessions/branching.el

(defun jf/gptel--write-branch-metadata (branch-dir parent-branch-name &optional branch-point-position)
  "Write branch metadata to BRANCH-DIR.
PARENT-BRANCH-NAME is the name of the parent branch (e.g., \"main\").
BRANCH-POINT-POSITION is optional position in parent where branch was created."
  (let ((metadata-file (jf/gptel--branch-metadata-file-path branch-dir))
        (timestamp (format-time-string "%Y-%m-%dT%H:%M:%S%z")))
    (with-temp-file metadata-file
      (insert "parent_branch: " parent-branch-name "\n")
      (insert "created: " timestamp "\n")
      (when branch-point-position
        (insert "branch_point_position: " (number-to-string branch-point-position) "\n")))
    (jf/gptel--log 'info "Created branch-metadata.yml with parent: %s" parent-branch-name)))

(defun jf/gptel--set-drawer-property-in-buffer (key value)
  "Set drawer property KEY to VALUE in the current buffer's drawer.

Operates on the `:PROPERTIES:' / `:END:' block at `point-min'
\(`register/shape/drawer-text-block').  When a `:KEY: ...' line exists
between the header and `:END:', its value is REPLACED in place (no
duplicate key).  When the key is absent, a `:KEY: VALUE' line is
inserted immediately before `:END:', preserving the block's adjacency
invariant.  Assumes the drawer is present and well-formed; callers
guard that precondition."
  (save-excursion
    (goto-char (point-min))
    (let ((line-re (concat "^:" (regexp-quote key) ":[ \t].*$")))
      (if (re-search-forward line-re nil t)
          (replace-match (format ":%s: %s" key value) t t)
        (when (re-search-forward "^:END:$" nil t)
          (goto-char (match-beginning 0))
          (insert (format ":%s: %s\n" key value)))))))

(defun jf/gptel--rewrite-branch-identity-keys (session-file session-id branch-name)
  "Set SESSION-FILE's drawer `:GPTEL_SESSION_ID:'/`:GPTEL_BRANCH:' keys.

SESSION-FILE is the new branch's `session.org' path.  SESSION-ID is
the shared session id (set as `:GPTEL_SESSION_ID:').  BRANCH-NAME is
the new branch's own name (set as `:GPTEL_BRANCH:', overwriting any
value the parent drawer carried — `register/invariant/branch-drawer-
shares-id-not-branch').

Reads SESSION-FILE, REPLACES the two identity keys in its leading
`register/shape/drawer-text-block' (append-if-absent), and writes the
content back.  When the file has no `:PROPERTIES:' / `:END:' drawer at
`point-min', it is left untouched."
  (with-temp-buffer
    (insert-file-contents session-file)
    (goto-char (point-min))
    (when (and (looking-at-p ":PROPERTIES:\n")
               (save-excursion (re-search-forward "^:END:$" nil t)))
      (jf/gptel--set-drawer-property-in-buffer "GPTEL_SESSION_ID" session-id)
      (jf/gptel--set-drawer-property-in-buffer "GPTEL_BRANCH" branch-name)
      (write-region (point-min) (point-max) session-file nil 'silent)
      (jf/gptel--log 'info
                     "Rewrote branch identity keys: %s (session-id=%s branch=%s)"
                     session-file session-id branch-name))))

(defun jf/gptel--create-branch-session (session-dir parent-branch-name branch-name branch-position)
  "Create new branch inside SESSION-DIR.
SESSION-DIR - session directory containing branches
PARENT-BRANCH-NAME - name of parent branch (e.g., \"main\")
BRANCH-NAME - user-provided name for branch
BRANCH-POSITION - buffer position marking the branch point (already
adjusted for include/exclude by the caller; see
`jf/gptel--branching-turn-branch-point').

Returns new branch directory path."
  (let* ((parent-branch-dir (jf/gptel--branch-dir-path session-dir parent-branch-name))
         ;; Create timestamped branch name
         (timestamp (format-time-string "%Y%m%d%H%M%S"))
         (new-branch-name (format "%s-%s" timestamp branch-name))
         ;; Create new branch directory
         (branch-dir (jf/gptel--create-branch-directory session-dir new-branch-name))
         (parent-context (jf/gptel--context-file-path parent-branch-dir))
         (branch-context (jf/gptel--context-file-path branch-dir)))

    (jf/gptel--log 'info "Creating branch: %s from parent: %s"
                   new-branch-name parent-branch-name)

    ;; Note: scope.yml and metadata.yml are no longer copied. The
    ;; parent's preset AND scope (`:GPTEL_SCOPE_*:' keys) propagate
    ;; to the new branch via the `:PROPERTIES:' drawer embedded at
    ;; the top of the parent's session.org, which the
    ;; truncated-context copy below preserves verbatim (design
    ;; Decision 7; gptel-scope-in-org-properties drawer-resident
    ;; scope).

    ;; Create branch-metadata.yml
    (jf/gptel--write-branch-metadata branch-dir parent-branch-name branch-position)

    ;; Copy agent directories from parent branch
    (jf/gptel--copy-branch-agents parent-branch-dir branch-dir)

    ;; Copy and truncate session.org
    (jf/gptel--copy-truncated-context parent-context branch-context branch-position)

    ;; Overwrite the new branch's identity keys in the verbatim-copied
    ;; drawer (register/invariant/branch-drawer-shares-id-not-branch):
    ;; the branch SHARES the session id but gets its OWN branch name.
    ;; The parent's `:GPTEL_BRANCH:' value (e.g. "main") rode along in
    ;; the verbatim copy; it MUST be REPLACED with NEW-BRANCH-NAME (not
    ;; appended) so two branches never collide on the registry key
    ;; "session-id/branch-name" and no duplicate drawer key survives.
    ;; `:GPTEL_SESSION_ID:' is re-asserted to the shared id (the copy
    ;; already carries it, but a parent drawer predating identity-key
    ;; emission would not).
    (jf/gptel--rewrite-branch-identity-keys
     branch-context
     (jf/gptel--session-id-from-directory session-dir)
     new-branch-name)

    ;; Update current symlink to point to new branch
    (jf/gptel--update-current-symlink session-dir new-branch-name)

    (jf/gptel--log 'info "Branch created successfully: %s" new-branch-name)
    branch-dir))
