config/gptel/sessions/branching.el

(defun jf/gptel-branch-session (&optional branch-name)
  "Create a branch from current branch at a selected user turn.

Interactively:
1. Prompts user to select a branch point — a numbered list of outer
   `#+begin_user' blocks in the current buffer.
2. Asks whether to include or exclude the selected turn.
3. Prompts for branch name.
4. Creates a new branch directory with copied metadata and truncated
   context (verbatim byte copy up to the branch point position).
5. Opens the new branch's `session.org' buffer.

The new branch is created under the same session with:
- Timestamped branch name: <timestamp>-<user-name>
- branch-metadata.yml tracking the parent branch name and branch-point position
- Copied agent subdirectories from parent branch
- session.org truncated at the branch-point position (the parent's
  `:PROPERTIES:' drawer at point-min is preserved verbatim, so the
  new branch inherits the parent's preset AND `:GPTEL_SCOPE_*:'
  keys automatically — gptel-scope-in-org-properties
  drawer-resident scope)
- current symlink updated to point to the new branch

After creation, the branch can evolve independently from the parent.

If the source session buffer has unsaved changes, `save-buffer' is
called before branch-point selection. This keeps the branch-point
position source (the live buffer) and the branch content source (the
on-disk `session.org', read verbatim by
`jf/gptel--copy-truncated-context') byte-identical, preventing silent
misalignment between computed positions and copied bytes. This mirrors
the sessions subsystem's persistence convention, where writing a
session uses plain `save-buffer' (no gptel--bounds drawer to manage)."
  (interactive)

  ;; Verify current buffer is a branch session in chat-mode.
  (unless (and (boundp 'jf/gptel--session-dir) jf/gptel--session-dir
              (boundp 'jf/gptel--branch-name) jf/gptel--branch-name)
    (user-error "Current buffer is not a gptel branch session"))

  (unless (derived-mode-p 'gptel-chat-mode)
    (user-error "Current buffer is not in gptel-chat-mode"))

  ;; Flush any unsaved parent edits before computing branch-point
  ;; positions against the live buffer. Positions and the bytes
  ;; copied by `jf/gptel--copy-truncated-context' must come from the
  ;; same source of truth; otherwise a dirty parent buffer causes
  ;; silent byte-offset misalignment in the new branch's session.org.
  (when (buffer-modified-p)
    (save-buffer))

  ;; Select branch point.
  (let* ((branch-point-data (jf/gptel--branching-select-branch-point))
         (branch-position (car branch-point-data))
         ;; Save parent info before switching buffers.
         (parent-branch-name jf/gptel--branch-name)
         (parent-session-id jf/gptel--session-id)
         ;; Prompt for branch name.
         (user-branch-name (or branch-name
                               (read-string "Branch name: ")))
         ;; Create branch.
         (new-branch-dir (jf/gptel--create-branch-session
                          jf/gptel--session-dir
                          parent-branch-name
                          user-branch-name
                          branch-position))
         (new-branch-file (jf/gptel--context-file-path new-branch-dir))
         (new-branch-name (file-name-nondirectory new-branch-dir)))

    ;; Open new branch session buffer (auto-initializes via find-file-hook).
    (find-file new-branch-file)

    (message "Created branch: %s\nFrom parent: %s\nSession: %s"
             new-branch-name
             parent-branch-name
             parent-session-id)))

(provide 'gptel-session-branching)
;;; branching.el ends here
